tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
#include "web/IrrigationWeb.h"

#include <Arduino.h>
#include <Esp32Base.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

#include "Pins.h"
#include "Version.h"
#include "domain/FlowMeter.h"
#include "domain/LeakMonitor.h"
#include "domain/MaintenanceService.h"
#include "domain/ValveController.h"
#include "domain/WateringSession.h"
#include "storage/EventStore.h"
#include "storage/PlanSkipStore.h"
#include "storage/PlanStore.h"
#include "storage/RecordStore.h"
#include "storage/SettingsStore.h"

namespace {

void writeBool(bool value) {
    Esp32BaseWeb::sendChunk(value ? "true" : "false");
}

void writeUInt(uint32_t value) {
    char text[16];
    snprintf(text, sizeof(text), "%lu", static_cast<unsigned long>(value));
    Esp32BaseWeb::sendChunk(text);
}

void writeInt(int32_t value) {
    char text[16];
    snprintf(text, sizeof(text), "%ld", static_cast<long>(value));
    Esp32BaseWeb::sendChunk(text);
}

void beginJson(int code = 200) {
    (void)Esp32BaseWeb::beginResponse(code, "application/json", nullptr);
}

void endJson() {
    Esp32BaseWeb::endResponse();
}

void sendMethodNotAllowed(const char* allowed) {
    beginJson(405);
    Esp32BaseWeb::sendChunk("{\"ok\":false,\"error\":\"method_not_allowed\",\"allowed\":\"");
    Esp32BaseWeb::writeJsonEscaped(allowed);
    Esp32BaseWeb::sendChunk("\",\"method\":\"");
    Esp32BaseWeb::writeJsonEscaped(Esp32BaseWeb::currentMethodName());
    Esp32BaseWeb::sendChunk("\"}");
    endJson();
}

bool readUIntParam(const char* name, uint16_t* value) {
    char text[16] = "";
    if (!Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return false;
    }
    char* end = nullptr;
    const long parsed = strtol(text, &end, 10);
    if (!end || *end != '\0' || parsed < 0 || parsed > 65535) {
        return false;
    }
    *value = static_cast<uint16_t>(parsed);
    return true;
}

bool readU32Param(const char* name, uint32_t* value) {
    char text[16] = "";
    if (!Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return false;
    }
    char* end = nullptr;
    const unsigned long parsed = strtoul(text, &end, 10);
    if (!end || *end != '\0') {
        return false;
    }
    *value = static_cast<uint32_t>(parsed);
    return true;
}

bool readYmdParam(const char* name, uint32_t* value) {
    char text[16] = "";
    if (!value || !Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return false;
    }
    if (strlen(text) == 10 && text[4] == '-' && text[7] == '-') {
        for (uint8_t i = 0; i < 10; ++i) {
            if ((i == 4 || i == 7) ? text[i] != '-' : (text[i] < '0' || text[i] > '9')) {
                return false;
            }
        }
        const uint32_t year = static_cast<uint32_t>((text[0] - '0') * 1000 + (text[1] - '0') * 100 + (text[2] - '0') * 10 + (text[3] - '0'));
        const uint32_t month = static_cast<uint32_t>((text[5] - '0') * 10 + (text[6] - '0'));
        const uint32_t day = static_cast<uint32_t>((text[8] - '0') * 10 + (text[9] - '0'));
        *value = year * 10000UL + month * 100UL + day;
        return true;
    }
    return readU32Param(name, value);
}

bool readBoolParam(const char* name, bool* value) {
    char text[8] = "";
    if (!Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return false;
    }
    if (strcmp(text, "1") == 0 || strcmp(text, "true") == 0 || strcmp(text, "on") == 0) {
        *value = true;
        return true;
    }
    if (strcmp(text, "0") == 0 || strcmp(text, "false") == 0) {
        *value = false;
        return true;
    }
    return false;
}

bool readModeParam(const char* name, SettingsStore::ExecutionMode* mode) {
    char text[20] = "";
    return Esp32BaseWeb::getParam(name, text, sizeof(text)) && SettingsStore::parseExecutionMode(text, mode);
}

bool readMinuteOfDayParam(const char* name, uint16_t* minuteOfDay) {
    char text[8] = "";
    if (!minuteOfDay || !Esp32BaseWeb::getParam(name, text, sizeof(text)) || strlen(text) != 5 || text[2] != ':') {
        return false;
    }
    if (text[0] < '0' || text[0] > '9' || text[1] < '0' || text[1] > '9' ||
        text[3] < '0' || text[3] > '9' || text[4] < '0' || text[4] > '9') {
        return false;
    }
    const uint8_t hour = static_cast<uint8_t>((text[0] - '0') * 10 + (text[1] - '0'));
    const uint8_t minute = static_cast<uint8_t>((text[3] - '0') * 10 + (text[4] - '0'));
    if (hour > 23 || minute > 59) {
        return false;
    }
    *minuteOfDay = static_cast<uint16_t>(hour * 60U + minute);
    return true;
}

uint16_t minutesToSeconds(uint16_t minutes) {
    return minutes > 240 ? 0 : static_cast<uint16_t>(minutes * 60U);
}

bool readDurationSecondsParam(const char* name, uint16_t* seconds) {
    uint16_t minutes = 0;
    if (!seconds || !readUIntParam(name, &minutes) || minutes < 1 || minutes > 240) {
        return false;
    }
    *seconds = static_cast<uint16_t>(minutes * 60U);
    return true;
}

bool readPlanDurationSecondsParam(const char* name, uint16_t* seconds) {
    uint16_t minutes = 0;
    if (!seconds || !readUIntParam(name, &minutes) || minutes > 240) {
        return false;
    }
    *seconds = static_cast<uint16_t>(minutes * 60U);
    return true;
}

uint8_t countConfigFields() {
    uint8_t count = 0;
    const char* fields[] = {
        "road",
        "default_mode",
        "quick_r1_min",
        "quick_r2_min",
        "flow_no_pulse_timeout_s",
        "idle_leak_window_s",
        "idle_leak_pulse_threshold",
        "r1_name",
        "r2_name",
        "r1_pulse_per_liter",
        "r2_pulse_per_liter",
        "r1_calibration_x1000",
        "r2_calibration_x1000",
    };
    for (const char* field : fields) {
        if (Esp32BaseWeb::hasParam(field)) {
            ++count;
        }
    }
    return count;
}

void writeMinutesFromSeconds(uint32_t seconds) {
    writeUInt(seconds / 60UL);
}

void writeFixed2FromX100(uint32_t value) {
    char text[20];
    snprintf(text, sizeof(text), "%lu.%02lu", static_cast<unsigned long>(value / 100UL), static_cast<unsigned long>(value % 100UL));
    Esp32BaseWeb::sendChunk(text);
}

void writeLitersFromMl(uint32_t ml) {
    char text[20];
    snprintf(text, sizeof(text), "%lu.%03lu L", static_cast<unsigned long>(ml / 1000UL), static_cast<unsigned long>(ml % 1000UL));
    Esp32BaseWeb::sendChunk(text);
}

uint8_t readLimitParam(uint8_t defaultLimit, uint8_t maxLimit) {
    uint16_t raw = defaultLimit;
    if (Esp32BaseWeb::hasParam("limit") && (!readUIntParam("limit", &raw) || raw == 0)) {
        return defaultLimit;
    }
    if (raw > maxLimit) {
        raw = maxLimit;
    }
    return static_cast<uint8_t>(raw);
}

const char* modeLabel(SettingsStore::ExecutionMode mode) {
    return mode == SettingsStore::MODE_SEQUENTIAL ? "顺序浇水" : "同时浇水";
}

