tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void sendHeader(const char* title, const char* pageClass) {
    Esp32BaseWeb::setHeadExtraCallback(writeCss);
    Esp32BaseWeb::sendHeader(title);
    Esp32BaseWeb::setHeadExtraCallback(nullptr);
    Esp32BaseWeb::sendChunk("<script>document.body.className='");
    Esp32BaseWeb::writeHtmlEscaped(pageClass);
    Esp32BaseWeb::sendChunk("';</script><main class='shell'>");
}

void sendFooter() {
    Esp32BaseWeb::sendChunk("</main>");
    Esp32BaseWeb::sendFooter();
}

void redirectTo(const char* path) {
    Esp32BaseWeb::redirectSeeOther(path);
}

void writePageHead(const char* title, const char* subtitle) {
    Esp32BaseWeb::sendChunk("<header class='page-head'><div><h1>");
    Esp32BaseWeb::writeHtmlEscaped(title);
    Esp32BaseWeb::sendChunk("</h1><p class='subtitle'>");
    Esp32BaseWeb::writeHtmlEscaped(subtitle);
    Esp32BaseWeb::sendChunk("</p></div></header>");
}

void writeWateringStatusPanel(const char* title) {
    Esp32BaseWeb::sendChunk("<div class='panel span-12'><h2>");
    Esp32BaseWeb::writeHtmlEscaped(title);
    Esp32BaseWeb::sendChunk("</h2><div class='overview-status status-compact'><div><span>当前浇水</span><strong>");
    Esp32BaseWeb::writeHtmlEscaped(WateringSession::isActive() ? modeLabel(WateringSession::mode()) : "未运行");
    Esp32BaseWeb::sendChunk("</strong></div></div><div class='valve-matrix' role='table'><div class='matrix-head'>项目</div><div class='matrix-head'>第 1 路</div><div class='matrix-head'>第 2 路</div>");
    const char* labels[] = {"状态", "目标", "剩余", "水量", "流速"};
    for (uint8_t row = 0; row < 5; ++row) {
        Esp32BaseWeb::sendChunk("<div class='matrix-label'>");
        Esp32BaseWeb::sendChunk(labels[row]);
        Esp32BaseWeb::sendChunk("</div>");
        for (uint8_t road = 1; road <= 2; ++road) {
            const WateringSession::RoadStatus& status = WateringSession::roadStatus(road);
            const bool enabled = SettingsStore::isRoadEnabled(road);
            uint32_t remainingSec = 0;
            if (status.state == WateringSession::ROAD_RUNNING && status.targetSec > 0) {
                const uint32_t elapsed = (Esp32BaseSystem::uptimeMs() - status.startedMs) / 1000UL;
                remainingSec = elapsed < status.targetSec ? status.targetSec - elapsed : 0;
            }
            const uint32_t pulses = status.lastPulseCount >= status.startedPulseCount ? status.lastPulseCount - status.startedPulseCount : 0;
            Esp32BaseWeb::sendChunk("<div><strong>");
            if (!enabled && row > 0) {
                Esp32BaseWeb::sendChunk("-");
            } else if (row == 0) {
                Esp32BaseWeb::writeHtmlEscaped(enabled ? roadStateLabel(status.state) : "未启用");
            } else if (row == 1) {
                writeMinutesFromSeconds(status.targetSec);
                Esp32BaseWeb::sendChunk(" 分钟");
            } else if (row == 2) {
                writeMinutesFromSeconds(remainingSec);
                Esp32BaseWeb::sendChunk(" 分钟");
            } else if (row == 3) {
                writeLitersFromMl(SettingsStore::estimateMilliliters(road, pulses));
            } else {
                writeFixed2FromX100(flowRateLiterPerMinuteX100(road));
                Esp32BaseWeb::sendChunk(" L/min");
            }
            Esp32BaseWeb::sendChunk("</strong></div>");
        }
    }
    Esp32BaseWeb::sendChunk("</div><div class='valve-action'>");
    const bool active = WateringSession::isActive();
    const char* disabled = active ? "" : " disabled";
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/water/stop' data-confirm='确认停止全部浇水？'><input type='hidden' name='road' value='0'><button class='secondary'");
    Esp32BaseWeb::sendChunk(disabled);
    Esp32BaseWeb::sendChunk(">停止全部</button></form>");
    for (uint8_t road = 1; road <= 2; ++road) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/water/stop' data-confirm='确认停止第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路？'><input type='hidden' name='road' value='");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("'><button class='secondary'");
        Esp32BaseWeb::sendChunk(active && SettingsStore::isRoadEnabled(road) ? "" : " disabled");
        Esp32BaseWeb::sendChunk(">停止第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路</button></form>");
    }
    Esp32BaseWeb::sendChunk(active ? "" : "<span class='note'>当前未运行，停止不可用。</span>");
    Esp32BaseWeb::sendChunk("</div></div>");
}

void writeManualStartPanel() {
    const SettingsStore::Settings& settings = SettingsStore::current();
    Esp32BaseWeb::sendChunk("<div class='panel span-12 manual-start'><h2>手动浇水</h2><p class='inline-notice note'>上次操作：");
    Esp32BaseWeb::writeHtmlEscaped(WateringSession::stopReasonName(WateringSession::lastStopReason()));
    Esp32BaseWeb::sendChunk("</p><form method='post' action='/api/v1/water/start' data-confirm='确认开始手动浇水？'><div class='manual-mode'><div class='field'><label>执行模式</label><select name='mode'>");
    writeModeOptions(settings.defaultMode);
    Esp32BaseWeb::sendChunk("</select></div><p class='note'>同时模式会一起开阀，顺序模式按路号依次执行。</p></div><div class='manual-road-grid'>");
    for (uint8_t road = 1; road <= 2; ++road) {
        const bool enabled = SettingsStore::isRoadEnabled(road);
        Esp32BaseWeb::sendChunk("<div class='manual-road");
        Esp32BaseWeb::sendChunk(enabled ? "" : " off");
        Esp32BaseWeb::sendChunk("'><div class='manual-road-head'><strong>第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路</strong><span class='badge");
        Esp32BaseWeb::sendChunk(enabled ? " ok" : " off");
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::sendChunk(enabled ? "已启用" : "未启用");
        Esp32BaseWeb::sendChunk("</span></div><div class='manual-fields'><label><span>参与</span><select name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_enabled'");
        Esp32BaseWeb::sendChunk(enabled ? "" : " disabled");
        Esp32BaseWeb::sendChunk("><option value='1'>浇水</option><option value='0'");
        writeSelected(!enabled);
        Esp32BaseWeb::sendChunk(">");
        Esp32BaseWeb::sendChunk(enabled ? "不浇水" : "未启用");
        Esp32BaseWeb::sendChunk("</option></select></label><label><span>时长</span><span class='input-suffix'><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_min' type='number' min='1' max='240' value='");
        writeMinutesFromSeconds(settings.quickDurationSec[road - 1]);
        Esp32BaseWeb::sendChunk("'");
        Esp32BaseWeb::sendChunk(enabled ? "" : " disabled");
        Esp32BaseWeb::sendChunk("><em>分钟</em></span></label></div></div>");
    }
    Esp32BaseWeb::sendChunk("</div><div class='actions'><button>开始浇水</button></div></form></div>");
}

const char* signalQuality(long rssi) {
    if (rssi >= -60) return "优秀";
    if (rssi >= -70) return "良好";
    if (rssi >= -80) return "一般";
    return "较弱";
}

void handleOverviewPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    sendHeader("首页", "page-overview");
    writePageHead("首页", "查看当前状态，并执行即时浇水和停止操作。");
    Esp32BaseWeb::sendChunk("<section class='grid'><div class='panel span-12'><h2>设备状态</h2><div class='overview-status'><div><span>设备</span><strong><span class='badge ok'>正常</span></strong></div><div><span>当前</span><strong>");
    Esp32BaseWeb::sendChunk(WateringSession::isActive() ? "浇水中" : "空闲");
    Esp32BaseWeb::sendChunk("</strong></div><div><span>WiFi</span><strong>");
#if ESP32BASE_ENABLE_WIFI
    Esp32BaseWeb::writeHtmlEscaped(Esp32BaseWiFi::ssid());
    Esp32BaseWeb::sendChunk("</strong></div><div><span>信号</span><strong>");
    Esp32BaseWeb::writeHtmlEscaped(signalQuality(Esp32BaseWiFi::rssi()));
    Esp32BaseWeb::sendChunk(" (");
    char rssi[16];
    snprintf(rssi, sizeof(rssi), "%ld dBm", static_cast<long>(Esp32BaseWiFi::rssi()));
    Esp32BaseWeb::writeHtmlEscaped(rssi);
#else
    Esp32BaseWeb::sendChunk("-");
    Esp32BaseWeb::sendChunk("</strong></div><div><span>信号</span><strong>-");
#endif
    Esp32BaseWeb::sendChunk(")</strong></div></div></div>");
    writeWateringStatusPanel("浇水状态");
    writeManualStartPanel();
    Esp32BaseWeb::sendChunk("<div class='panel span-12'><h2>异常</h2>");
    if (LeakMonitor::hasAlert()) {
        Esp32BaseWeb::sendChunk("<span class='badge danger'>存在异常</span><p class='note'>请确认现场状态，处理后清除提示。</p><form method='post' action='/api/v1/alerts/clear' data-confirm='确认现场已处理并解除异常提示？'><button>解除异常</button></form>");
    } else {
        Esp32BaseWeb::sendChunk("<span class='badge ok'>无当前异常</span><p class='note'>存在异常时在这里显示当前原因和状态；设备级诊断请查看基础库日志。</p>");
    }
    Esp32BaseWeb::sendChunk("</div></section>");
    sendFooter();
}

