tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writePlanContent(const PlanStore::Plan& plan) {
    bool first = true;
    for (uint8_t road = 1; road <= 2; ++road) {
        if (plan.roadSec[road - 1] == 0) continue;
        if (!first) Esp32BaseWeb::sendChunk("，");
        first = false;
        Esp32BaseWeb::sendChunk("第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路 ");
        writeMinutesFromSeconds(plan.roadSec[road - 1]);
        Esp32BaseWeb::sendChunk(" 分钟");
    }
    if (first) Esp32BaseWeb::sendChunk("未设置");
}

void writeCycleText(const PlanStore::Plan& plan) {
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk(" 天循环，执行第 ");
    bool first = true;
    for (uint8_t i = 0; i < plan.cycleDays; ++i) {
        if ((plan.cycleMask & (1UL << i)) == 0) continue;
        if (!first) Esp32BaseWeb::sendChunk("、");
        first = false;
        writeUInt(i + 1);
    }
    Esp32BaseWeb::sendChunk(" 天");
}

const char* statusClass(const char* status) {
    if (strcmp(status, "已完成") == 0) return " ok";
    if (strcmp(status, "进行中") == 0) return " danger";
    if (strcmp(status, "已跳过") == 0) return " warn";
    return "";
}

const char* dayLabel(int8_t offset) {
    if (offset == 0) return "今天";
    if (offset == 1) return "明天";
    if (offset == 2) return "后天";
    return "近期";
}

bool writeRecentRows(const char* label, int8_t offset, uint32_t ymd) {
    const uint16_t nowMinute = currentMinuteOfDay();
    bool any = false;
    for (uint8_t i = 0; i < PlanStore::MaxPlans; ++i) {
        const PlanStore::Plan& plan = PlanStore::get(i);
        const bool skipped = PlanSkipStore::isSkipped(i, ymd);
        const bool completed = plan.lastRunYmd == ymd;
        const bool running = WateringSession::isActive() && WateringSession::source() == RecordStore::SOURCE_PLAN && offset == 0 && plan.minuteOfDay == nowMinute;
        if (!plan.enabled && !completed && !running) continue;
        if (plan.enabled && !PlanStore::shouldRunOnDate(plan, ymd)) continue;
        any = true;
        const bool pastToday = offset == 0 && plan.minuteOfDay < nowMinute;
        const char* status = completed ? "已完成" : (running ? "进行中" : (skipped ? "已跳过" : (pastToday ? "未执行" : "未开始")));
        Esp32BaseWeb::sendChunk("<tr><td>");
        Esp32BaseWeb::writeHtmlEscaped(label);
        Esp32BaseWeb::sendChunk("<span class='title-date'>");
        writeYmd(ymd);
        Esp32BaseWeb::sendChunk("</span></td><td>");
        writeMinuteOfDay(plan.minuteOfDay);
        Esp32BaseWeb::sendChunk("</td><td>计划 ");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk("</td><td>");
        writePlanContent(plan);
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(modeLabel(plan.mode));
        Esp32BaseWeb::sendChunk("</td><td><span class='badge");
        Esp32BaseWeb::sendChunk(statusClass(status));
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::writeHtmlEscaped(status);
        Esp32BaseWeb::sendChunk("</span></td><td>");
        Esp32BaseWeb::sendChunk(completed ? "按计划完成" : (running ? "正在执行" : (skipped ? "已跳过这一次" : (pastToday ? "已过执行时间" : "等待执行"))));
        Esp32BaseWeb::sendChunk("</td><td>");
        if (plan.enabled && !completed && !running && !pastToday && !skipped) {
            Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/plans/skip' data-confirm='确认跳过本次计划？'><input type='hidden' name='action' value='skip_once'><input type='hidden' name='index' value='");
            writeUInt(i);
            Esp32BaseWeb::sendChunk("'><input type='hidden' name='ymd' value='");
            writeUInt(ymd);
            Esp32BaseWeb::sendChunk("'><button class='warn'>跳过本次</button></form>");
        } else if (skipped) {
            Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/plans/skip' data-confirm='确认取消跳过本次计划？'><input type='hidden' name='action' value='clear_skip'><input type='hidden' name='index' value='");
            writeUInt(i);
            Esp32BaseWeb::sendChunk("'><input type='hidden' name='ymd' value='");
            writeUInt(ymd);
            Esp32BaseWeb::sendChunk("'><button class='secondary'>取消跳过</button></form>");
        } else {
            Esp32BaseWeb::sendChunk("-");
        }
        Esp32BaseWeb::sendChunk("</td></tr>");
    }
    return any;
}

void handlePlansPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    sendHeader("近期计划", "page-table");
    writePageHead("近期计划", "查看今天、明天、后天的计划执行状态，并按单次跳过未来未执行计划。");
    Esp32BaseWeb::sendChunk("<section class='grid'><div class='panel span-12'><div class='table-wrap'><table class='action-table'><thead><tr><th>日期</th><th>时间</th><th>计划</th><th>内容</th><th>模式</th><th>状态</th><th>说明</th><th>操作</th></tr></thead><tbody>");
    bool any = false;
    bool timeSynced = true;
    for (int8_t offset = 0; offset <= 2; ++offset) {
        tm date = {};
        if (!localDateFromOffset(offset, &date)) {
            timeSynced = false;
            break;
        }
        const uint32_t ymd = makeYmd(date);
        any = writeRecentRows(dayLabel(offset), offset, ymd) || any;
    }
    if (!timeSynced) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='8'>时间未同步</td></tr>");
    } else if (!any) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='8'>今天、明天、后天无计划</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div></div></section>");
    sendFooter();
}

void handlePlanConfigPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    sendHeader("计划配置", "page-table");
    writePageHead("计划配置", "这里只修改计划内容；执行结果在近期计划和历史记录页查看。");
    Esp32BaseWeb::sendChunk("<section class='grid'><div class='panel span-12'><h2>计划列表</h2><div class='table-wrap'><table><thead><tr><th>状态</th><th>计划</th><th>时间</th><th>循环规则</th><th>内容</th><th>操作</th></tr></thead><tbody>");
    for (uint8_t i = 0; i < PlanStore::MaxPlans; ++i) {
        const PlanStore::Plan& plan = PlanStore::get(i);
        Esp32BaseWeb::sendChunk("<tr><td><span class='badge");
        Esp32BaseWeb::sendChunk(plan.enabled ? " ok" : " off");
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::sendChunk(plan.enabled ? "启用" : "停用");
        Esp32BaseWeb::sendChunk("</span></td><td>计划 ");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeMinuteOfDay(plan.minuteOfDay);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeCycleText(plan);
        Esp32BaseWeb::sendChunk("</td><td>");
        writePlanContent(plan);
        Esp32BaseWeb::sendChunk("，");
        Esp32BaseWeb::writeHtmlEscaped(modeLabel(plan.mode));
        Esp32BaseWeb::sendChunk("</td><td><a class='button secondary' href='/irrigation/plan?edit=");
        writeUInt(i);
        Esp32BaseWeb::sendChunk("'>修改</a></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div></div></section>");
    sendFooter();
}

