tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeRoadJson(uint8_t road) {
    const WateringSession::RoadStatus& st = WateringSession::roadStatus(road);
    const uint32_t pulses = st.lastPulseCount >= st.startedPulseCount ? st.lastPulseCount - st.startedPulseCount : 0;
    Esp32BaseWeb::sendChunk("{\"enabled\":");
    writeBool(SettingsStore::isRoadEnabled(road));
    Esp32BaseWeb::sendChunk(",\"state\":\"");
    Esp32BaseWeb::writeJsonEscaped(WateringSession::roadStateName(st.state));
    Esp32BaseWeb::sendChunk("\",\"target_sec\":");
    writeUInt(st.targetSec);
    Esp32BaseWeb::sendChunk(",\"estimated_ml\":");
    writeUInt(SettingsStore::estimateMilliliters(road, pulses));
    Esp32BaseWeb::sendChunk(",\"flow_l_min\":");
    writeFixed2FromX100(flowRateLiterPerMinuteX100(road));
    Esp32BaseWeb::sendChunk(",\"valve_open\":");
    writeBool(ValveController::isOpen(road));
    Esp32BaseWeb::sendChunk("}");
}

void writeWateringJson() {
    Esp32BaseWeb::sendChunk("\"watering\":{\"active\":");
    writeBool(WateringSession::isActive());
    Esp32BaseWeb::sendChunk(",\"mode\":\"");
    Esp32BaseWeb::writeJsonEscaped(modeName(WateringSession::mode()));
    Esp32BaseWeb::sendChunk("\",\"last_stop_reason\":\"");
    Esp32BaseWeb::writeJsonEscaped(WateringSession::stopReasonName(WateringSession::lastStopReason()));
    Esp32BaseWeb::sendChunk("\",\"roads\":{\"r1\":");
    writeRoadJson(1);
    Esp32BaseWeb::sendChunk(",\"r2\":");
    writeRoadJson(2);
    Esp32BaseWeb::sendChunk("}}");
}

void writePlanJson(uint8_t index, const PlanStore::Plan& p) {
    Esp32BaseWeb::sendChunk("{\"index\":");
    writeUInt(index);
    Esp32BaseWeb::sendChunk(",\"enabled\":");
    writeBool(p.enabled);
    Esp32BaseWeb::sendChunk(",\"minute_of_day\":");
    writeUInt(p.minuteOfDay);
    Esp32BaseWeb::sendChunk(",\"road_sec\":{\"r1\":");
    writeUInt(p.roadSec[0]);
    Esp32BaseWeb::sendChunk(",\"r2\":");
    writeUInt(p.roadSec[1]);
    Esp32BaseWeb::sendChunk("},\"mode\":\"");
    Esp32BaseWeb::writeJsonEscaped(modeName(p.mode));
    Esp32BaseWeb::sendChunk("\",\"cycle_days\":");
    writeUInt(p.cycleDays);
    Esp32BaseWeb::sendChunk(",\"cycle_mask\":");
    writeUInt(p.cycleMask);
    Esp32BaseWeb::sendChunk(",\"cycle_start_ymd\":");
    writeUInt(p.cycleStartYmd);
    Esp32BaseWeb::sendChunk(",\"last_run_ymd\":");
    writeUInt(p.lastRunYmd);
    Esp32BaseWeb::sendChunk("}");
}

void handleStatusApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    char text[32];
    beginJson();
    Esp32BaseWeb::sendChunk("{\"firmware\":{\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(Esp32Base::firmwareName());
    Esp32BaseWeb::sendChunk("\",\"version\":\"");
    Esp32BaseWeb::writeJsonEscaped(Esp32Base::firmwareVersion());
    Esp32BaseWeb::sendChunk("\"},\"wifi\":{\"connected\":");
#if ESP32BASE_ENABLE_WIFI
    writeBool(Esp32BaseWiFi::isConnected());
    Esp32BaseWeb::sendChunk(",\"ssid\":\"");
    Esp32BaseWeb::writeJsonEscaped(Esp32BaseWiFi::ssid());
    Esp32BaseWeb::sendChunk("\",\"rssi\":");
    writeInt(static_cast<int32_t>(Esp32BaseWiFi::rssi()));
    Esp32BaseWeb::sendChunk(",\"ip\":\"");
    char ip[24] = "";
    (void)Esp32BaseWiFi::ip(ip, sizeof(ip));
    Esp32BaseWeb::writeJsonEscaped(ip);
#else
    writeBool(false);
    Esp32BaseWeb::sendChunk(",\"ssid\":\"\",\"rssi\":0,\"ip\":\"");
#endif
    Esp32BaseWeb::sendChunk("\"},\"time\":{\"synced\":");
    writeBool(Esp32BaseNtp::isTimeSynced());
    Esp32BaseWeb::sendChunk(",\"current\":\"");
    if (!Esp32BaseNtp::formatTime(text, sizeof(text), "%Y-%m-%d %H:%M:%S")) text[0] = '\0';
    Esp32BaseWeb::writeJsonEscaped(text);
    Esp32BaseWeb::sendChunk("\"},\"records\":{\"count\":");
    writeUInt(RecordStore::count());
    Esp32BaseWeb::sendChunk(",\"capacity\":");
    writeUInt(RecordStore::capacity());
    Esp32BaseWeb::sendChunk("},\"events\":{\"count\":");
    writeUInt(EventStore::count());
    Esp32BaseWeb::sendChunk(",\"capacity\":");
    writeUInt(EventStore::capacity());
    Esp32BaseWeb::sendChunk("},");
    writeSettingsJson();
    Esp32BaseWeb::sendChunk(",");
    writeWateringJson();
    Esp32BaseWeb::sendChunk("}");
    endJson();
}

bool rejectIfFactoryResetPending() {
    if (!MaintenanceService::factoryResetPending()) {
        return false;
    }
    Esp32BaseWeb::sendJson(409, "{\"ok\":false,\"error\":\"factory_reset_pending\"}");
    return true;
}

void sendConfigError(const char* error) {
    beginJson(400);
    Esp32BaseWeb::sendChunk("{\"ok\":false,\"error\":\"");
    Esp32BaseWeb::writeJsonEscaped(error ? error : "invalid_config");
    Esp32BaseWeb::sendChunk("\"}");
    endJson();
}

bool saveConfigFromRequest(const char** error) {
    if (error) {
        *error = nullptr;
    }
    uint16_t value = 0;
    bool boolValue = false;
    char text[12] = "";
    bool ok = true;
    if (countConfigFields() != 1) {
        if (error) {
            *error = "one_config_field_required";
        }
        return false;
    }
    if (Esp32BaseWeb::hasParam("road")) {
        uint16_t road = 0;
        ok = readUIntParam("road", &road) && readBoolParam("enabled", &boolValue) && SettingsStore::setRoadEnabled(static_cast<uint8_t>(road), boolValue);
    } else if (Esp32BaseWeb::hasParam("default_mode")) {
        SettingsStore::ExecutionMode mode = SettingsStore::MODE_SIMULTANEOUS;
        ok = readModeParam("default_mode", &mode) && SettingsStore::setDefaultExecutionMode(mode);
    } else if (Esp32BaseWeb::hasParam("quick_r1_min")) {
        uint16_t seconds = 0;
        ok = readDurationSecondsParam("quick_r1_min", &seconds) && SettingsStore::setQuickDurationSec(1, seconds);
    } else if (Esp32BaseWeb::hasParam("quick_r2_min")) {
        uint16_t seconds = 0;
        ok = readDurationSecondsParam("quick_r2_min", &seconds) && SettingsStore::setQuickDurationSec(2, seconds);
    } else if (Esp32BaseWeb::hasParam("flow_no_pulse_timeout_s")) {
        ok = readUIntParam("flow_no_pulse_timeout_s", &value) && value <= 60 && SettingsStore::setFlowNoPulseTimeoutSec(static_cast<uint8_t>(value));
    } else if (Esp32BaseWeb::hasParam("idle_leak_window_s")) {
        ok = readUIntParam("idle_leak_window_s", &value) && value <= 60 && SettingsStore::setIdleLeakWindowSec(static_cast<uint8_t>(value));
    } else if (Esp32BaseWeb::hasParam("idle_leak_pulse_threshold")) {
        ok = readUIntParam("idle_leak_pulse_threshold", &value) && value <= 100 && SettingsStore::setIdleLeakPulseThreshold(static_cast<uint8_t>(value));
    } else if (Esp32BaseWeb::hasParam("r1_name")) {
        ok = Esp32BaseWeb::getParam("r1_name", text, sizeof(text)) && SettingsStore::setRoadName(1, text);
    } else if (Esp32BaseWeb::hasParam("r2_name")) {
        ok = Esp32BaseWeb::getParam("r2_name", text, sizeof(text)) && SettingsStore::setRoadName(2, text);
    } else if (Esp32BaseWeb::hasParam("r1_pulse_per_liter")) {
        ok = readUIntParam("r1_pulse_per_liter", &value) && SettingsStore::setRoadPulsePerLiter(1, value);
    } else if (Esp32BaseWeb::hasParam("r2_pulse_per_liter")) {
        ok = readUIntParam("r2_pulse_per_liter", &value) && SettingsStore::setRoadPulsePerLiter(2, value);
    } else if (Esp32BaseWeb::hasParam("r1_calibration_x1000")) {
        ok = readUIntParam("r1_calibration_x1000", &value) && SettingsStore::setRoadCalibrationX1000(1, value);
    } else if (Esp32BaseWeb::hasParam("r2_calibration_x1000")) {
        ok = readUIntParam("r2_calibration_x1000", &value) && SettingsStore::setRoadCalibrationX1000(2, value);
    } else {
        ok = false;
    }
    if (!ok) {
        if (error) {
            *error = "invalid_config";
        }
        return false;
    }
    (void)EventStore::append(EventStore::TYPE_CONFIG_CHANGED, EventStore::SOURCE_WEB, 0, 0, SettingsStore::roadEnabledMask(), 0, "config saved");
    return true;
}

