tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeEventJsonCb(const EventStore::Event& event, void* user) {
    bool* first = static_cast<bool*>(user);
    if (!*first) Esp32BaseWeb::sendChunk(",");
    *first = false;
    Esp32BaseWeb::sendChunk("{\"id\":");
    writeUInt(event.id);
    Esp32BaseWeb::sendChunk(",\"uptime_ms\":");
    writeUInt(event.uptimeMs);
    Esp32BaseWeb::sendChunk(",\"epoch\":");
    writeUInt(event.epoch);
    Esp32BaseWeb::sendChunk(",\"type\":\"");
    Esp32BaseWeb::writeJsonEscaped(EventStore::typeName(static_cast<EventStore::Type>(event.type)));
    Esp32BaseWeb::sendChunk("\",\"source\":\"");
    Esp32BaseWeb::writeJsonEscaped(EventStore::sourceName(static_cast<EventStore::Source>(event.source)));
    Esp32BaseWeb::sendChunk("\",\"road\":");
    writeUInt(event.road);
    Esp32BaseWeb::sendChunk(",\"code\":");
    writeUInt(event.code);
    Esp32BaseWeb::sendChunk(",\"value1\":");
    writeInt(event.value1);
    Esp32BaseWeb::sendChunk(",\"value2\":");
    writeInt(event.value2);
    Esp32BaseWeb::sendChunk(",\"text\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.text);
    Esp32BaseWeb::sendChunk("\"}");
}

void handleEventsApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    beginJson();
    Esp32BaseWeb::sendChunk("{\"count\":");
    writeUInt(EventStore::count());
    Esp32BaseWeb::sendChunk(",\"capacity\":");
    writeUInt(EventStore::capacity());
    Esp32BaseWeb::sendChunk(",\"events\":[");
    bool first = true;
    (void)EventStore::readLatest(0, readLimitParam(20, 50), writeEventJsonCb, &first);
    Esp32BaseWeb::sendChunk("]}");
    endJson();
}

}

namespace IrrigationWeb {

void begin() {
    const bool overviewOk = Esp32BaseWeb::addPage("/irrigation", "首页", handleOverviewPage);
    const bool recentOk = Esp32BaseWeb::addPage("/irrigation/plans", "近期计划", handlePlansPage);
    const bool dataOk = Esp32BaseWeb::addPage("/irrigation/data", "历史记录", handleDataPage);
    const bool configPageOk = Esp32BaseWeb::addPage("/irrigation/plan-config", "计划配置", handlePlanConfigPage);
    const bool settingsOk = Esp32BaseWeb::addPage("/irrigation/settings", "灌溉设置", handleSettingsPage);
    const bool planEditOk = Esp32BaseWeb::addRoute("/irrigation/plan", Esp32BaseWeb::METHOD_GET, handlePlanEditPage);
    const bool settingsConfigOk = Esp32BaseWeb::addRoute("/irrigation/settings/config", Esp32BaseWeb::METHOD_POST, handleSettingsConfigForm);
    const bool statusOk = Esp32BaseWeb::addApi("/api/v1/status", handleStatusApi);
    const bool configOk = Esp32BaseWeb::addApi("/api/v1/config", handleConfigApi);
    const bool startOk = Esp32BaseWeb::addApi("/api/v1/water/start", handleWaterStartApi);
    const bool stopOk = Esp32BaseWeb::addApi("/api/v1/water/stop", handleWaterStopApi);
    const bool recordsOk = Esp32BaseWeb::addApi("/api/v1/records", handleRecordsApi);
    const bool eventsOk = Esp32BaseWeb::addApi("/api/v1/events", handleEventsApi);
    const bool plansOk = Esp32BaseWeb::addApi("/api/v1/plans", handlePlansApi);
    const bool skipOk = Esp32BaseWeb::addApi("/api/v1/plans/skip", handlePlanSkipApi);
    const bool alertsOk = Esp32BaseWeb::addApi("/api/v1/alerts/clear", handleAlertsClearApi);
    ESP32BASE_LOG_I("irrigation.web", "routes overview=%s recent=%s planConfig=%s data=%s settings=%s planEdit=%s settingsConfig=%s status=%s config=%s start=%s stop=%s records=%s events=%s plans=%s skip=%s alerts=%s firmware=%s",
                    overviewOk ? "ok" : "fail",
                    recentOk ? "ok" : "fail",
                    configPageOk ? "ok" : "fail",
                    dataOk ? "ok" : "fail",
                    settingsOk ? "ok" : "fail",
                    planEditOk ? "ok" : "fail",
                    settingsConfigOk ? "ok" : "fail",
                    statusOk ? "ok" : "fail",
                    configOk ? "ok" : "fail",
                    startOk ? "ok" : "fail",
                    stopOk ? "ok" : "fail",
                    recordsOk ? "ok" : "fail",
                    eventsOk ? "ok" : "fail",
                    plansOk ? "ok" : "fail",
                    skipOk ? "ok" : "fail",
                    alertsOk ? "ok" : "fail",
                    IrrigationVersion::FirmwareName);
}

}
